backend_api/app/Controllers/Barang.php

SELECT `barang`.*, `kategori`.`nama_kategori`, `supplier`.`nama_supplier`
FROM `barang`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `barang`.`id_kategori`
LEFT JOIN `supplier` ON `supplier`.`id_supplier` = `barang`.`id_supplier`
---
    public function index()
    {
        $model = new BarangModel();

        // Kita pakai teknik JOIN biar yang tampil nama kategorinya, bukan cuma angka ID-nya
        $data = $model->select('barang.*, kategori.nama_kategori, supplier.nama_supplier')
                      ->join('kategori', 'kategori.id_kategori = barang.id_kategori', 'left')
                      ->join('supplier', 'supplier.id_supplier = barang.id_supplier', 'left')
                      ->findAll();

INSERT INTO `barang` (`nama_barang`, `stok`, `id_kategori`, `id_supplier`) VALUES ('Asus ROG', 0, '1', '1')
---
    public function create()
    {
        $model = new BarangModel();

        // Tangkap data JSON dari Axios VueJS
        $json = $this->request->getJSON();

        if ($json) {
            $data = [
                'nama_barang' => $json->nama_barang,
                'stok'        => $json->stok,
                'id_kategori' => $json->id_kategori,
                'id_supplier' => $json->id_supplier
            ];
        } else {
            $data = [
                'nama_barang' => $this->request->getVar('nama_barang'),
                'stok'        => $this->request->getVar('stok'),
                'id_kategori' => $this->request->getVar('id_kategori'),
                'id_supplier' => $this->request->getVar('id_supplier')
            ];
        }

        $model->insert($data);