backend_api/app/Controllers/Api/Auth.php

    public function login()
    {
        // Tangkap data JSON dari Axios VueJS
$json = $this->request->getJSON();
if ($json) {
    $email = $json->useremail;
    $password = $json->userpassword;
} else {
    // Buat jaga-jaga kalau dites pakai form-data di Postman
    $email = $this->request->getVar('useremail');
    $password = $this->request->getVar('userpassword');
}

        $model = new UserModel();

        // 2. Cari user berdasarkan email
        $user = $model->where('useremail', $email)->first();
---
SELECT *
FROM `users`
WHERE `useremail` = 'admin@email.com'
 LIMIT 1